{
  "id": "BEAST_PRISM_UNFORM",
  "entry": {
    "name": "Prism Unform",
    "type": "Spectral Hue Aberration",
    "threat_level": "⚠️ High – Dangerous in prolonged engagements",
    "first_emerged": "Nullshade Collapse",
    "description": "The Prism Unform is a constantly shifting humanoid silhouette.\nEach second, it flickers between visual states: violet dreamshards, golden flare echoes, crimson pulses, and green growth flickers.\n\nThe edges of its form seem to stutter, as though reality can’t agree what it once was.",
    "hue_interaction": "Cycles through hue-based attacks in glitched order.\n\nMay cast a Red spell followed by a corrupted Blue one.\n\nAttacks grow stronger as the player unlocks more Hue alignments.\n\nUnaffected by single-hue barriers; vulnerable to total hue nullification fields.",
    "behavior": "Pursues the player slowly until provoked, then attacks with abrupt hue surges.\n\nAdapts to player habits: it may repeat a spell the player recently used.\n\nOccasionally pauses mid-fight, as if recalling something.",
    "weaknesses": "Vulnerable during moments of stasis between hue transitions.\n\nThe Nullfield Sigil (artifact) suppresses its spectrum and reveals its core.\n\nSilent spells or attacks without elemental tags confuse it temporarily.",
    "notes": "Some say defeating it causes a flicker in the environment, revealing a flash of the player's first memory choice.\nOthers report no drops — only a glow, like mourning."
  },
  "lore": {
    "title": "Crystal Monolith Etching, Nullshade Sector V",
    "quote": "“It shifts. It splinters. It remembers every color but its own.”",
    "flavor_description": [
      "A spectral figure that flickers between all hues, each fragment representing a broken alignment.",
      "Mimics attacks and spells from multiple Orders in unstable, glitched forms."
    ],
    "field_notes": [
      "“We wore colors like crowns. Then we drowned in them. One escaped the palette. One became many.”",
      "",
      "“The Unform wasn't made. It occurred. A glitch in memory. A reflection of those who wore every hue and called it balance.”",
      "",
      "“They say it remembers your colors before you do. That it chooses what you forget.”",
      "",
      "“It flickers — not because it's weak, but because the truth burns too brightly to hold still.”"
    ],
    "source": "Prism Unform – Crystal Monolith Etching, Nullshade Sector V"
  },
  "drops": []
}