{
  "id": "BEAST_MIRRORWAKE_DUELIST",
  "entry": {
    "name": "Mirrorwake Duelist",
    "type": "Illusory Swordmaster / Storm-Arena Echo",
    "threat_level": "⚠️ High – Unpredictable & Reflection-Bound",
    "first_emerged": "After the Collapse of the Skyglass Arena",
    "description": "A duelist bound not to memory, but to mirrored surfaces. She moves across puddles, fragments, and skyglass panels with eerie grace — her attacks calibrated to the player’s form, reflected with lethal delay.\n\nShe does not speak. Her blade interprets your posture like a question.",
    "hue_interaction": "Only vulnerable when reflected simultaneously in two surfaces (water/glass).\n\nCrimson clashes disrupt her rhythm; Cobalt echoes reveal hidden stances.\n\nVerdant’s vines distort her movement path but do not bind her.",
    "behavior": "Shifts position by teleporting between reflective zones.\n\nBehavior cycle:\n- Mirage Lunge – charges where your reflection last moved.\n- Refracted Parry – blocks frontal Hue spells with mirrored delay.\n- Glassflame Riposte – strikes from an adjacent reflection after being dodged.",
    "weaknesses": "Mirrorwake loses coordination if the player breaks all local reflections (e.g., shattering panels or vaporizing puddles).\n\nCombat simplified during storm-induced fog, which dulls mirrored clarity.\n\nTemporarily stunned by Payne’s Brush illusions (overwhelms her sense of “who is real”).",
    "notes": "Skydancer lore claims her final opponent left behind no reflection.\nSome say if you defeat her without casting a shadow, she will bow… and vanish."
  },
  "lore": {
    "title": "Blade Between Reflections",
    "quote": "“She fights in reflections. Yours. Hers. Anyone’s.”",
    "flavor_description": [
      "Flickers into mirrored puddles or glass surfaces.",
      "Her blade leaves no wound — only a fading silhouette of the strike.",
      "Eyes shine like still water before a storm."
    ],
    "field_notes": [
      "“Her duels never end. Not because she wins, but because the mirror never breaks.”",
      "",
      "“In life, she was a master of the Skyglass Pillars — undefeated, yet unremembered.”",
      "",
      "“When the storms shattered the arena’s ceiling, she was still mid-swing.”",
      "",
      "“Some say her opponent left. Others say he never existed.”",
      "",
      "“Now, she reflects the one who enters — matching form, speed, and flaw.”",
      "",
      "“There are no spectators anymore. Only reflections.”",
      "",
      "“She draws her sword when your gaze lingers too long.”"
    ],
    "source": "Whispered in the Skyglass Arena’s Empty Hall"
  },
  "drops": []
}