{
  "id": "BEAST_PHYLACTERY_SWARM",
  "entry": {
    "name": "Phylactery Swarm",
    "type": "Soul‑Fragmented Parasites",
    "threat_level": "⚠️ Moderate-to-Severe – Memory Drain",
    "first_emerged": "Post-Shattering, shortly after the collapse of the Phylactery Vault",
    "description": "A drifting swarm of glimmering, fly-like constructs with miniature glyphs engraved on their chitin. Each holds a fragment of a soul — stolen, gifted, or long abandoned. They buzz softly, repeating half-spoken names and severed dreams.",
    "hue_interaction": "Brown-bound memory spells repel or redirect their feeding pattern.\n\nViolet illusions confuse their targeting (they can’t find the “real” name).\n\nBlue mind-based defenses lock out name resonance, reducing damage over time.",
    "behavior": "Aggressive in clusters; each hit reduces XP, disrupts equipped memory-bound relics, or causes temporary skill fog.\n\nThey prioritize targets with the most stored names, such as players with saved dialogue trees, memory fragments, or death-echoes.\n\nIf fed a “forgotten name” (e.g. an unused True Name), the swarm dissipates peacefully.",
    "weaknesses": "Fire magic burns them outright — especially from purified sources.\n\nSonic pulses from Violet-aligned instruments cause disarray in their flight pattern.\n\nBistre Lantern stuns them in shadow if activated in silence.",
    "notes": "Destroying a swarm sometimes releases “Whispers in Dust,” a rare crafting essence used for soul-bound relic upgrades. But if you kill them while carrying a forgotten name, your own may become unstable in the Codex."
  },
  "lore": {
    "title": "The Names That Never Rest",
    "quote": "“If they whisper your name, run. If they forget it — it’s already too late.”",
    "flavor_description": [
      "Tiny. Hungry. Each holds a name they never earned.",
      "A cloud of brass-eyed, soulbound insects formed from failed phylacteries — vessels meant to preserve life, now drifting husks of stolen identities."
    ],
    "field_notes": [
      "“At first, I thought them ash-fleas. Harmless, if persistent. But the swarm began to sing — in names. Names I had forgotten.”",
      "",
      "“They circle. They whisper. And if one touches skin, a piece of memory loosens.”",
      "",
      "“Caput Mortuum warned us: failed phylacteries don’t just break — they scatter. A name is a soul’s handle. These insects collect… and misuse.”",
      "",
      "“I burned the scrolls. I prayed over the ink. Still, they murmured the names I never told anyone.”",
      "",
      "“If you’ve forgotten your own voice, they’ll help. But it will cost you.”"
    ],
    "source": "Fragmented field report from the Bistre Archivist, sealed in ash"
  },
  "drops": []
}