{
  "id": "BEAST_MOTH_WITCH_VERDANT_SPIRAL",
  "entry": {
    "name": "Moth-Witch of the Verdant Spiral",
    "type": "Verdant/Cobalt Fey-Caster – Boss Entity",
    "threat_level": "☠️ High – Environmental/Mental Hazard",
    "first_emerged": "Unknown – Possibly pre-Color War anomaly",
    "description": "Tall, robed in layered silk woven from moth-skin and flower dust. Her eyes bloom and close like petals. Her wings emit a soporific sound that alters thought and slows reflexes.\n\nSurrounded by a swarm of Thalera moths that shimmer between green and blue — each tied to emotional memory.",
    "hue_interaction": "Alternates between Verdant (Green) and Cobalt (Blue) alignment in phase rhythm.\n\nHer moths carry hue echoes: when struck, they trigger illusion sequences from the player’s past.\n\nShe is vulnerable only during “dewing” phase — when her wings pulse and the air becomes thick with spores.",
    "behavior": "Opens combat with a riddle. Choosing an answer affects the battlefield (correct = stable terrain; wrong = shifting illusions).\n\nCasts:\n- Spiral Bloom: creates a ring of growing vines that traps and roots the player unless escaped via blink/dash.\n- Whispercloak: renders her briefly invisible; only her moths remain visible.\n- Mirrored Murmurs: mimics a previously encountered NPC’s voice to distract or mislead.\n\nPhase 2 (below 50% HP):\n- Wings shed completely. Movement becomes erratic and dance-like.\n- Moths become explosive, triggering illusion bursts or emotion-based debuffs (e.g., confusion, hesitation).",
    "weaknesses": "Vulnerable to sonic feedback (e.g., echo-pulse, chord runes).\n\nCannot be silenced, but speaking her true name during the second riddle phase will briefly stun her.\n\nLantern-based vision tools (e.g., Bistre Lantern) reveal her true shape during Whispercloak.",
    "notes": "Her death does not yield treasure — it yields a question:\n\n“Was she ever real… or was she your future, grown in the wrong direction?”\n\nOptional encounter. Found only by following a non-map-marked moth trail in the Verdant region during dusk cycle.\n\nDefeating her unlocks the “Thalera Bloom” — a memory sigil that lets the player resist fear-induced status effects and decode flora-based glyphs."
  },
  "lore": {
    "title": "Dreambloom Recordings, Entry 17",
    "quote": "“She doesn't cast spells. She releases questions that root into you.”",
    "flavor_description": [
      "Eyes like blossoms. Wings like whispers.",
      "She speaks in riddles while you bleed. She hums while your reflection loses its face."
    ],
    "field_notes": [
      "“She speaks in riddles while you bleed. She hums while your reflection loses its face. But she’s not cruel. She simply doesn’t understand what truth is anymore.”",
      "",
      "“The Verdant Spiral wasn’t a place. It was a question that grew out of control. Moss crept into logic. Petals wrapped around doubt. And at the center — her.”",
      "",
      "“I saw a thousand moths, all with my face. Then none with eyes. Then only her, smiling as my voice said her name backwards.”",
      "",
      "“If you find her, do not speak. Let her wings speak first. That is the test.”"
    ],
    "source": "Extract from “Dreambloom Recordings, Entry 17” – Archivist Sellen Orvine"
  },
  "drops": []
}