{
  "id": "BEAST_RUSTWORN_JUDGE",
  "entry": {
    "name": "Rustworn Judge",
    "type": "Spectral Adjudicator / Trialbound Duelist",
    "threat_level": "⚠️ High (Triggers zone-wide “duel” state)",
    "first_emerged": "Post-Shattering – Bound to the Isabelline Tribunal Ruins",
    "description": "Tall, silent, and clad in lacquered remnants of gold and crimson armor, the Rustworn Judge emerges in areas where too many lies or falsehoods have been spoken. Its sword drags across the ground like a gavel across cracked marble.\n\nWhen it engages, the HUD disappears. Only heartbeats, footfalls, and spoken choices remain.",
    "hue_interaction": "Cannot perceive illusions — Violet-bound players may delay confrontation.\n\nAttuned to Earthen truths; lying in dialogue triggers its full aggression.\n\nWill challenge Crimson-bound characters more harshly, invoking blood-duel rites.",
    "behavior": "Begins neutral; approaches only if a dialogue deception or broken vow is detected nearby.\n\nUpon engagement, all other threats vanish from the arena — this becomes a Trial Zone.\n\nSpeaks only in verdicts: “Guilty,” “Paused,” “Judged.” Each phase tightens its aggression.",
    "weaknesses": "During the “Paused” phase, players may offer a Memory Token from a known past regret to delay the duel.\n\nThe Bistre Lantern, when lit at the edge of the arena, reveals its original name — speaking this name aloud (in dialogue) weakens its form.\n\nDefeated only by a perfect parry during its “Judged” strike or by ending the duel through confession.",
    "notes": "Players who lie or misremember their past actions during combat will have movement briefly impaired. It is not the Judge’s blade that slays — but your own dishonesty echoing back."
  },
  "lore": {
    "title": "The Tribunal of Dust",
    "quote": "“Silence is guilt. Speak, and be tested.”",
    "flavor_description": [
      "Once a duelist of the Mikado Warlord’s court, now reduced to a corroded phantom enshrined in ceremonial armor.",
      "It drifts through forgotten trial chambers in the Dimming Hollow, demanding judgment where justice has long rotted."
    ],
    "field_notes": [
      "“He presided over the Ash Trials — where guilt was presumed, and memory was the only plea. His blade struck truth from hesitation.”",
      "",
      "“When the Catacombs crumbled, the Judge did not fall. He simply waited, verdict unspoken, blade still angled toward indecision.”",
      "",
      "“We say: do not argue with the rust. It has waited longer than you have drawn breath.”"
    ],
    "source": "Fragment from “The Tribunal of Dust” — Sootleaf Scroll, Mortuum Hold"
  },
  "drops": []
}