{
  "id": "BEAST_BLOODROOT_EFFIGY",
  "entry": {
    "name": "Bloodroot Effigy",
    "type": "Ritual Golem / Floral Martyr Construct",
    "threat_level": "⚠️ Very High – Reflective Damage & Environmental Risk",
    "first_emerged": "Ember Shrines, shortly after Verdant Suppression War",
    "description": "The Bloodroot Effigy is a grotesque sacred construct — a hybrid of bone, bloom, and flame. Originally created as a shrine to fallen warriors, it grew restless under constant veneration. Now it walks, its joints creaking with hymns and its veins coursing with sacrificial heat. Any who strike it are struck in return — unless their cause aligns with the green.",
    "hue_interaction": "Reflects all direct Crimson or Earthen damage back at the attacker.\n\nOnly Verdant-bound players can bypass the pain mirror — the roots recognize kin.\n\nCan be pacified with Cobalt Mind Echo, revealing fragments of the memories it contains.",
    "behavior": "Moves slowly until attacked — then enters a rage phase, swinging with vine-wrapped fists.\n\nEmits a damage-sharing aura — all within it are harmed when it takes damage.\n\nOccasionally drops to its knees and prays — healing over time unless interrupted.",
    "weaknesses": "Vulnerable to stealth-based attacks or environmental triggers (falling pillars, acid blooms).\n\nWeakens when exposed to pure light or mirrored flame (used in certain shrine puzzles).\n\nDuring prayer stance, can be calmed permanently by using Verdant Lullaby relic.",
    "notes": "The bloodroot vines inside it are still alive. If you cut it down gently, it weeps — and sometimes, just sometimes, leaves behind a relic carved with a name that isn’t yours… but feels like it could’ve been."
  },
  "lore": {
    "title": "Shrine of the Martyr's Bloom",
    "quote": "Built of martyr bones. Fueled by prayer.",
    "flavor_description": [
      "Humanoid construct formed from tangled heroic remains, bound with bloodroot vines.",
      "Emits flame-laced aura that damages both attacker and itself.",
      "Cursed to mirror the pain it receives — unless the attacker is Verdant-bound."
    ],
    "field_notes": [
      "“This is what we do with heroes: we bury them, then build something out of the bones.”",
      "",
      "“The Effigy was never meant to fight. It was meant to kneel. A shrine made from those who died ‘gloriously’ — their armor melted into bark, their prayers twisted into flame.”",
      "",
      "“But memory is a seed. And too much blood feeds the wrong roots.”",
      "",
      "“Now it rises. Now it hurts what hurts it. Every time we ask it to stand for us, it forgets it was meant to rest.”",
      "",
      "— Graffiti scrawled by an unknown priest, later found burned into his own robes"
    ],
    "source": "Found etched into a stone altar in the Shrine of Ashpetal"
  },
  "drops": []
}