{
  "id": "BEAST_MOSSGRAVE_REVENANT",
  "entry": {
    "name": "Mossgrave Revenant",
    "type": "Spectral Knight / Verdant Spirit",
    "threat_level": "⚠️ High – Hazardous in close quarters, warps memory",
    "first_emerged": "Early Post-Shattering Era",
    "description": "Clad in ivy-entwined armor and wielding a memory-drenched blade, the Mossgrave Revenant is the restless ghost of a fallen Verdant knight. It emerges from overgrown gravesites or ancient glades, its presence heralded by the smell of damp soil and the whisper of a name you once forgot.",
    "hue_interaction": "Aura dampens Hue regen and subtly alters time perception, making dodges and counters feel mistimed.\n\nSword strikes cause Dream-Poison: induces ghostly hallucinations of the past.\n\nVulnerable to light-based or memory-echo spells (Cobalt or Earthen preferred).",
    "behavior": "Patrols sacred ruin-sites or lost glades where the forest has grown over old battlefields.\n\nDefends these places with grim resolve, attacking only when approached or disturbed.\n\nOccasionally pauses mid-combat to \"listen\" to the ground—reacts to memory resonance near graves.",
    "weaknesses": "Staggered by Celadon Shards, which resonate with buried memories.\n\nTemporarily stunned by Memory Echoes related to his past (scene-triggered flashbacks).\n\nVulnerable to light-infused weapons that pierce shadow and root alike.",
    "notes": "Scholars speculate the Revenant remembers not just his own life, but fragments of every life buried near him. Some who defeat him claim to hear a soft “thank you” as his moss crumbles and his sword returns to root. Others hear nothing—but dream of him for nights afterward."
  },
  "lore": {
    "title": "The Sleeping Warden",
    "quote": "“Even the ghosts here wear green.”",
    "flavor_description": [
      "A fallen warrior, bound by root and regret",
      "Armored specter overgrown with moss, ivy, and cracked Verdant glyphs."
    ],
    "field_notes": [
      "“Let no hue claim him. Let no name follow him. He bled green, and that was enough.”",
      "",
      "“They say the Verdant Orders buried their dead with vines wrapped tight—to carry memory down into the roots. But sometimes memory does not sleep. Sometimes, it stands up, sword in hand, searching for what it failed to protect.”",
      "",
      "“The Mossgrave Revenant was once a protector of Huevale’s sacred glades. When the Prism shattered, he fell defending a grove that did not survive. Now, he wanders, armor cracked and blooming, bound not by duty—but by grief.”",
      "",
      "“He does not speak. But those who linger in his presence report fragments of dreams: a child singing in a glade, a sword sinking into moss, a name whispered and forgotten. He attacks without rage, but with deep certainty—like a story trying to finish itself.”",
      "",
      "“To face him is to face the memory of a forest mourning through a blade.”"
    ],
    "source": "Lore Entry: Inscription etched on a stone sarcophagus, overgrown in the Tinctara Crypt-Ruins"
  },
  "drops": []
}