{
  "id": "BEAST_CITRINE_GOLEM",
  "entry": {
    "name": "Citrine Golem",
    "type": "Radiant Construct / Elemental Juggernaut",
    "threat_level": "⚠️⚠️ High – Nearly impervious under sunlight",
    "first_emerged": "Built during the early Aurelian Temple Age to guard vaults and forbidden scroll-tombs",
    "description": "Towering crystalline behemoth with arms like sculpted obelisks and a faceted citrine heart. It emits faint harmonic tones when struck, as if humming to itself. Carvings across its back depict solar rites and forgotten oaths.",
    "hue_interaction": "Absorbs Aurelian (Yellow) attacks completely, reflecting them as blinding flares\n\nSusceptible to extreme cold (Cobalt) and vibrational spells (sonic, echo-based)\n\nVerdant roots can crack surface if seeded in shadow",
    "behavior": "Stationary until provoked or until artifact proximity detected\n\nStomps ground to fracture terrain; creates radiant aftershocks that slow movement\n\n“Gleam Pulse” releases radial lightburst upon taking damage, stunning nearby attackers\n\nCan regenerate minor cracks if exposed to direct sunlight too long",
    "weaknesses": "Cobalt’s Stormglass Barrier can refract its light internally, causing harmonic overload\n\nBest fought in shaded or eclipse-affected areas\n\nEcho-charged percussion weapons (like Prismhammer) disrupt its inner resonance",
    "notes": "Citrine Golems were never meant to kill — only to withstand. Their presence marks places the sun itself once vowed to protect.\n\n“If it still stands, perhaps your purpose does not.”"
  },
  "lore": {
    "title": "The Unbreaking Gleam",
    "quote": "A gem is eternal. So is its temper.",
    "flavor_description": [
      "An immense construct of fused yellow-gold crystal, animated by ancient contracts of light.",
      "Though slow, its radiant fury is absolute — and its body, almost unbreakable under sunlit skies."
    ],
    "field_notes": [
      "“We found it half-buried beyond the Gamboge Vault — just another glimmering ridge in the sand, we thought. Until it stood.”",
      "",
      "“It didn’t roar. Didn’t run. It simply… turned. The light caught in its chest gem, and something inside me trembled. Like I owed it something.”",
      "",
      "“Every strike we landed was swallowed — reflected in glints, as if it watched our failures and polished them.”",
      "",
      "“I think it waits not to fight — but to endure. It judges worth by how hard you try before quitting.”"
    ],
    "source": "Scrawled notes from a sand-shielded expedition journal, author unknown"
  },
  "drops": []
}