{
  "id": "BEAST_HUEFRACTALS",
  "entry": {
    "name": "Huefractals",
    "type": "Prismatic Fragment / Living Hue Relic",
    "threat_level": "⚠️ Variable — Safe when still, catastrophic when agitated",
    "first_emerged": "Post-Core Collapse – Nullshade Genesis",
    "description": "These crystalline fragments of once-complete hue essence now drift, skitter, and hum with forgotten light. They are the aftershocks of color’s shattering — unstable, curious, and deadly when intersected.",
    "hue_interaction": "React violently to concentrated hue magic — especially if multiple hues are active.\n\nEach fragment carries an unstable “echo” of a specific hue. When struck, may cast random low-tier spell effects of that hue (e.g., Red = fire burst, Yellow = flash pulse).\n\nWhen three or more collide, they may cause a Hue Cascade — a zone-wide chromatic distortion field that temporarily disables all hue-bound abilities.",
    "behavior": "Not aggressive unless provoked by hue alignment, spells, or AoE proximity.\n\nIn some cases, may follow the player briefly, attempting to “resonate” — which can overload equipment or inflict hue blur.\n\nIn rare Nullshade time loops, Huefractals may briefly align and “sing” a lost color, triggering a puzzle glyph sequence.",
    "weaknesses": "Stabilized by complete silence — no music, no abilities, no movement.\n\nCan be grounded by Prism Glyph Anchors or Nullpulse fields (created via Nullshade puzzle completion).\n\nDestroyed Huefractals sometimes drop Fractal Residue — used to craft unstable hue grenades or Prism Shard keys.",
    "notes": "Some Archivists claim Huefractals are what remains of the Seventh Hue.\n\nIf one resonates with the player long enough without combat, a hidden memory scene may trigger — showing the moment the Prism broke, from a non-human perspective."
  },
  "lore": {
    "title": "Fragments of Forgotten Color",
    "quote": "They don’t attack. They collide with the possibility of you.",
    "flavor_description": [
      "Chaotic, living relics of the core...",
      "Shards of a spectrum that no longer remembers its name."
    ],
    "field_notes": [
      "“They were once part of something sacred. The Core sang with their chorus. But when the Prism cracked, the notes scattered and forgot the tune.”",
      "",
      "“Some tried to collect them. None returned whole. Not dead — just… chromatically incorrect.”",
      "",
      "“One danced near me once. It laughed in teal. Then wept in a color I didn’t have a word for.”",
      "",
      "“They want to return. But they don’t remember where they began. So they collide with anything that might have been their origin.”"
    ],
    "source": "Fragment from \"The Spectrum that Broke\" — Scrawlings in Nullshade Dust"
  },
  "drops": []
}