{
  "id": "BEAST_TAPESTRY_WATCHER_NULLSHADE_VARIANT",
  "entry": {
    "name": "Tapestry Watcher (Nullshade Variant)",
    "type": "Regret Construct / Decision Echo",
    "threat_level": "⚠️ High — Metaphysical Disruptor",
    "first_emerged": "Phase echo bleed near Core Wound's south ridge",
    "description": "A flickering silhouette of the original Auralith entity — now broken and refracted across Nullshade’s memory folds. Each one reflects paths the player never took, decisions avoided, truths left unsaid. It weaves with hands that aren't yours.",
    "hue_interaction": "Immune to color‑aligned spells — reacts only to anti‑aligned or unselected hues.\n\nGlows when within range of unfulfilled side quests or unused dialogue trees.",
    "behavior": "Appears in mirrored paths or failed puzzles.\n\nParalyzes the player momentarily with threads of “missing memory” — visuals from dialogue branches never taken.\n\nWill teleport behind the player if they ignore a manifested regret.",
    "weaknesses": "Can be defeated only by rewriting: through new decisions at reflection altars.\n\nIf engaged while carrying a Prism Archive Key, allows for one skipped regret to be resolved retroactively.\n\nSilence spells pause its animation; Bistre Lantern shows its original Auralith form for a moment.",
    "notes": "If defeated in all its variants, unlocks the full tapestry mural in Nullshade’s archive vault — a visual display of the player’s total unchosen truths.\n\nFinal Watcher, if spared, leaves behind a whisper: “The next you may still choose better.”"
  },
  "lore": {
    "title": "Unstable echo found near a Nullshade monolith gate",
    "quote": "“I saw her again, the one who never answered me. She wore the regrets I never voiced.”",
    "flavor_description": [
      "Threads twitch. You never pulled them. But they bleed anyway."
    ],
    "field_notes": [
      "“I saw her again, the one who never answered me. She wore the regrets I never voiced.”",
      "",
      "“These Watchers don’t judge. They haunt. They remind.”",
      "",
      "“Each one is a reflection — not of who you were, but of who you could’ve been.”",
      "",
      "“They unravel the story you didn’t tell.”"
    ],
    "source": "Lore Fragment: Unstable echo found near a Nullshade monolith gate"
  },
  "drops": []
}