{
  "id": "BEAST_BLOOMROT_TITAN",
  "entry": {
    "name": "Bloomrot Titan",
    "type": "Verdant Aberration / Rot Elemental",
    "threat_level": "⚠️ High – Wide-area corruption, persistent damage fields",
    "first_emerged": "Late Verdant Bloom Cycle – Region unknown",
    "description": "The Bloomrot Titan resembles a twisted colossus of animated bark, fungal caps, and rotting wildflowers. Its core pulses with toxic light — a hollow, glowing knot where its heart might’ve been.\n\nIt moves slowly but with explosive force, uprooting itself to crash down with trunk-sized limbs.",
    "hue_interaction": "- Aligned to Green, but corrupted — embodies growth without limit.\n- Highly resistant to healing spells and regenerative effects (will mutate or reverse them).\n- Weak to Crimson (purifying flame), Brown (memory disruption), and Yellow (aura manipulation).",
    "behavior": "- Spawns poisonous pollen clouds when struck — linger in air, causing hallucinations or reversed controls.\n- Launches explosive seed pods — each explodes into parasitic seedlings unless destroyed in time.\n- Occasionally “roots” itself to regenerate — vulnerable but emits thick fungal fog.",
    "weaknesses": "- Glowing chest core is vulnerable when attacking — exposes inner rot for brief moments.\n- Burning terrain around it limits its healing capacity.\n- “Truthroot Salts” or Caput Mortuum Alchemy slows its regrowth.",
    "notes": "Encountered deep in overgrown ruins, burial groves, or failed Verdant sanctuaries.\nIts death releases a ring of new growth — dangerous but collectible.\nSome Isabelline scrolls suggest the Titan was once a Warden — now consumed by what it once cultivated."
  },
  "lore": {
    "title": "The Root That Overreached",
    "quote": "It doesn’t breathe. It spores.",
    "flavor_description": [
      "A monstrous overgrowth of decay and wildness — born of Verdant excess left to rot.",
      "It towers over most enemies in the game, dragging whole root systems behind it like broken limbs."
    ],
    "field_notes": [
      "“Verdant magic was never supposed to be this… greedy. It heals, yes — but healing without judgment becomes infestation.”",
      "",
      "“The Titan wasn't born. It accumulated. Dead treants, overgrown shrines, corrupted spores, blood-fed vines — all swallowed into the same groaning body.”",
      "",
      "“It threw pods that screamed when they landed. And its chest… Gods, its chest was hollow, glowing green, as if the thing was ashamed of the rot it wore like bark.”",
      "",
      "“I cast a growth-stall glyph. It laughed. The sound came from its blossoms. From its moss. From inside me.”",
      "",
      "“We left that grove. Burned what we could. What we couldn’t still whispers in the roots.”"
    ],
    "source": "Field Record – “Rot in the Rootlands” by Huewarden Lilael"
  },
  "drops": []
}