{
  "id": "BEAST_MEMORY_GRAFTER",
  "entry": {
    "name": "Memory Grafter",
    "type": "Narrative Parasite / Nullshade Manipulator",
    "threat_level": "⚠️ High – Reality distortion and identity theft",
    "first_emerged": "Mid-Nullshade Collapse, during the Prism Shard Fracture",
    "description": "A tall, shrouded figure bearing a scroll of inked names and colored glyphs. Its face is an empty vellum mask that shifts depending on who sees it.\n\nMoves fluidly, yet without sound — always one step behind or ahead. Leaves behind fading afterimages that quote memories the player never made.",
    "hue_interaction": "Immune to most hue damage — instead, hue attacks are reflected as twisted abilities (e.g., a Green healing spell becomes a Brown decay tether).\n\nOccasionally rewrites one of your equipped abilities temporarily — switching it for a flawed version with different mechanics or cost.\n\nCan be destabilized briefly by Violet paradox effects or Bistre Lantern activations.",
    "behavior": "Doesn’t initiate combat in the usual sense — instead, lingers near puzzle areas or lore reveals.\n\nBegins by mimicking small parts of the player’s history: gear loadout, early dialogue, voice lines.\n\nIf not interrupted, escalates by replacing one of your passive traits or even UI labels (e.g., renaming a button from “Attack” to “Regret”).",
    "weaknesses": "Binding it within a Prism Sigil Circle can “pin” its scroll — revealing and undoing some of its grafts.\n\nInterrupted if a true memory is spoken aloud via a scripted prompt (player must recall something from early game).\n\nWeakens when confronted by another player-character’s memory shard (e.g., an NPC echo from a side quest).",
    "notes": "Memory Grafters are said to be the reason some Prismwalkers “go silent” — not because they die, but because they forget they existed.\n\nOne theory suggests they are fragments of Prismara’s subconscious — the Core trying to rewrite its own shame."
  },
  "lore": {
    "title": "Stolen Histories",
    "quote": "“You don’t remember losing your name — just that he started calling you something else.”",
    "flavor_description": [
      "He does not take lives. He replaces them.",
      "The Memory Grafter is not a killer — it is an editor.",
      "Cloaked in patchwork ink and hue-scratched robes, it walks the unseen line between truth and story, harvesting identity like fruit that ripened too early."
    ],
    "field_notes": [
      "“It didn’t kill her. It rewrote her. When I found what was left, she still moved like my sister. Still used her name. But when she spoke, I knew…”",
      "",
      "“She had new stories. Ones she hadn’t lived.”",
      "",
      "“He holds a scroll. Always writing. Always replacing. You see yourself on it, eventually.”",
      "",
      "“If you forget the color of your thoughts — you’ve already been grafted.”"
    ],
    "source": "Transcript Fragment – “Stolen Histories,” banned from the Bistre Archive"
  },
  "drops": []
}