{
  "id": "BEAST_GAMBOGE_DJINNLING",
  "entry": {
    "name": "Gamboge Djinnling",
    "type": "Elemental Trickster / Smoke Spirit",
    "threat_level": "⚠️ Variable – Harmless or catastrophic",
    "first_emerged": "During the Sun-Flecked Famine, post-Shattering",
    "description": "Born of scorched incense and forgotten rituals, Gamboge Djinnlings drift like playful smoke over ancient sands. Tiny, gleaming, and mischievous, they delight in twisting fortune — granting blessings laced with mayhem.",
    "hue_interaction": "Drawn to Aurelian-bound players; reacts to radiant spells with playful mimicry\n\nTemporarily soothed by Orange Peel Charms or trickster-aligned dialogue\n\nDisrupted by silence, darkness, or logical riddles",
    "behavior": "May offer players “bargains” — usually with ironic outcomes\n\nCast chaotic aura bursts at short range, altering spell loadouts or HP temporarily\n\nMay aid players in combat if amused or impressed\n\nFlee when too predictable — thrives on spontaneity",
    "weaknesses": "Vulnerable to emotional clarity (truth-bound spells, honesty artifacts)\n\nCannot pass through pure darkness or geometric constraint sigils\n\nTemporarily dissipated by citrus oils or harmonized chants",
    "notes": "Some scholars claim Djinnlings are fractured pieces of ancient wish-gods, forever seeking new vessels for chaos. Local traders treat them with a mix of reverence and exasperation.\n\n“If it floats and giggles in yellow — bow, lie, or run. Your choice matters less than how funny it is.”"
  },
  "lore": {
    "title": "The Bargain's Breath",
    "quote": "A wish, half-spoken. A trick, fully paid.",
    "flavor_description": [
      "A puff of promise… and price",
      "Born of scorched incense and forgotten rituals, Gamboge Djinnlings drift like playful smoke over ancient sands."
    ],
    "field_notes": [
      "“You don't summon a Gamboge Djinnling. You entertain one. And if it likes your song, your scent, or your story — it offers a deal. Usually bad.”",
      "",
      "“One drifted near my caravan during the brass eclipse. My horse learned to speak three tongues. My guide forgot how to walk forward.”",
      "",
      "“Never thank it. Never bargain without irony. And never uncork anything that still feels warm.”",
      "",
      "“They're children of the smoke left behind when gods abandon their lamps.”"
    ],
    "source": "Fragment from \"Desert Pacts and Ash-Laced Jars\" by Relic-Seer Yawen the Uncorked"
  },
  "drops": []
}