{
  "id": "BEAST_NULLSHADE_REVENANT",
  "entry": {
    "name": "Nullshade Revenant",
    "type": "Hue-Corrupted Undead / Memory Echo",
    "threat_level": "⚠️ High – Reality-distorting revenant",
    "first_emerged": "Nullshade Bloom, post-Prism Collapse",
    "description": "Once-alive figures from various Orders, their original hue still faintly flickering in their cloak seams or crystal bones. Their skin is cracked porcelain, leaking vaporized memory. Some hum old color chants. Others sob without tears.",
    "hue_interaction": "Cannot be aligned. Causes instability in the player’s current hue if struck or touched.\n\nEnters phase-shift state when near strong hue magic, becoming invisible or displaced unless lit by:\n• Cobalt (Blue) reality-lock sigils\n• Yellow (Hope) illusions refracted through the Thulian Mirror\n• Violet dream-lensing (Glamour Pulse)",
    "behavior": "Wanders aimlessly until triggered by:\n• Player casting a hue spell near them.\n• Touching a Memory Echo shrine.\n• Saying a phrase tied to their former hue allegiance.\n\nIn combat:\n• Heavy, deliberate swings — infused with color-ghosts of old abilities.\n• At 50% HP, they begin to teleport erratically, repeating your previous movements with lagging mimicry.",
    "weaknesses": "Must be lit by hue before becoming vulnerable: e.g., Blue Sigils, Lanterns, or truth-based illusions.\n\nCannot be silenced, but disrupted by lore items tied to their past self (e.g., Journal Fragments, Relic Sketches).\n\nPrismwalker Shard glow pulses stronger near them — a clue to real-space alignment.",
    "notes": "Some Prismwalkers report “remembering” events they never lived after battling one.\n\nThe Bistre Archivist theorized they are “souls who fractured across hues too often — now trapped in the space between.”"
  },
  "lore": {
    "title": "Core‑Walker’s Notes, Vol. VII",
    "quote": "“It remembers dying. It forgot why it came back.”",
    "flavor_description": [
      "A broken warrior or mage — once aligned with vivid hue — now drained, twisted, and filled with the noise of silence.",
      "Shimmers of past allegiance still cling to its form… barely."
    ],
    "field_notes": [
      "“We found her kneeling at the edge of a Shatterglass Pool. Not praying. Not breathing. Just… remembering.”",
      "",
      "“A crimson sash fluttered from one arm. A green tattoo pulsed beneath her cracked skin. Once, she was a hero of the Color War. Now, she barely casts a shadow.”",
      "",
      "“When she rose, her eyes didn’t see us. They saw some place we weren’t. She moved through our attacks like they hadn’t happened yet.”",
      "",
      "“Then she struck — and I forgot how to defend.”",
      "",
      "“The Nullshade does not raise the dead. It reflects what it means to never have died right.”"
    ],
    "source": "Excerpt from “Core‑Walker’s Notes, Vol. VII” – Anonymous Prismwalker"
  },
  "drops": []
}